import os
from pathlib import Path

from dotenv import load_dotenv

# завантаження .env
load_dotenv()

DATA_DIR = Path(os.getenv("DATA_DIR", "data"))
OUTPUT_DIR = Path(os.getenv("OUTPUT_DIR", "output"))
LOG_LEVEL = os.getenv("LOG_LEVEL", "INFO")

AREAS = [
    {"id": 1, "names": ["ЯМПОЛІВКА"], "description": "у стику 60 омбр та 63 омбр:"},
    {"id": 2, "names": ["ТОРСЬКЕ"], "description": "у смузі відповідальності 105 мб – 106 мб:"},
    {
        "id": 3,
        "names": ["ДІБРОВА", "КРЕМІННА"],
        "description": "у смузі відповідальності 105 мб, 107 мб, 155 мб:",
    },
]
TB_CONFIG = [
    {"num": 1, "width_inch": 4.5, "v_align": 1, "h_align": 1},
    {"num": 2, "width_inch": 7, "v_align": 1, "h_align": 0},
]
REPORT_HUR_PATH = r"../../Templates/report_hur.docx"

DOWNLOADS_PATH = r"C:/Downloads/"

REPORT_FILE = r"report_"

FOOTER_TEXT_1 = "* Добування розвідувальної інформації про противника здійснюється підрозділами РЕР, розгорнутими в смугах відповідальності ОТУ та надається для первинної обробки у відповідні підрозділи РЕР центрів (відділів) розвідки ОТУ, де інформація узагальнюється та надається короткий опис подій. "

FOOTER_TEXT_2 = "Матеріали радіоперехоплень в узагальненому вигляді від підрозділів РЕР ЦР (ВР) ОТУ у визначений час надаються черговому розвідки ОКП ОСУВ “Хортиця”. Інформація, яка потребує невідкладного доведення до начальника центру розвідки ОКП ОСУВ “Хортиця”, надається черговому розвідки ОКП ОСУВ “Хортиця” негайно по тлф з подальшим документальним підтвердженням."

FOOTER_SIGN = "Командир взводу РЕР ____________СТЕПУРА Андрій Іванович________________________"
